<?php
session_start();
unset($_SESSION['T_EQ']);


$score = isset($_SESSION['T_SCORE'])?$_SESSION['T_SCORE']:0;
$score = intval($score);
$str_score = '';
$str_th = '';
$str_en = '';
if($score <= 4){
    $str_score = $score;
    $str_th = 'ผู้สูงอายุ (กลุ่มติดเตียง)';
    $str_en = 'ผู้สูงอายุที่พึ่งตนเองไม่ได้ ช่วยเหลือตนเองไม่ได้ พิการ หรือทุพพลภาพ มีผลรวมคะแนน ADL อยู่ในช่วง 0-4 คะแนน
    คำแนะนำในการดูแลผู้สูงอายุ
        ญาติผู้ดูแลควรปรึกษาแพทย์เพื่อขอคำแนะนำในการดูแลผู้สูงอายุที่เหมาะสม เพื่อความปลอดภัย 
        เนื่องจากผู้ป่วยไม่สามารถช่วยเหลือตนเองได้ หรือไม่สามารถทำได้อย่างเต็มที่ ญาติผู้ดูแลจึงมีหน้าที่ดูแลฟื้นฟูสมรรถภาพของผู้ป่วย 
        ระมัดระวังเรื่องแผลกดทับโดยการหมั่นพลิกตัว เปลี่ยนท่านอนของผู้ป่วยทุกๆ 2 ชั่วโมง, การขับถ่าย ควรหมั่นดูแลเรื่องความสะอาดและความเปียกชื้น, 
        อาหารควรเป็นอาหารที่ย่อยง่าย ลดภาวะท้องอืดและท้องผูก รวมไปถึงการทำกายภาพบำบัดของผู้สูงอายุที่ต้องนอนติดเตียงให้ถูกต้องเหมาะสม 
        เพื่อป้องกันไม่ให้ข้อต่อต่างๆ ติดแข็งและยังเป็นการช่วยป้องกันภาวะแทรกซ้อน มุ่งสุขประโยชน์ที่พึงเกิดแก่ผู้สูงอายุเป็นหลัก 
        สามารถใช้ชีวิตอยู่ในครอบครัวและชุมชนได้ตามอัตภาพและไม่เสียชีวิตก่อนวัยอันควร
    ';
}elseif ($score <= 11){
    $str_score = $score;
    $str_th = 'ผู้สูงอายุ (กลุ่มติดบ้าน)';
    $str_en = 'ผู้สูงอายุที่ดูแลตนเองได้บ้าง ช่วยเหลือตนเองได้บ้าง มีผลรวมคะแนน ADL อยู่ในช่วง 5-11 คะแนน
    
    คำแนะนำในการดูแลผู้สูงอายุ
        ญาติผู้ดูแลควรให้ความสำคัญในการช่วยเหลือผู้สูงอายุที่เคลื่อนไหวได้ แต่อาจจะมีความลำบากหรือติดขัดในการเคลื่อนไหว 
        หรือทำสิ่งต่างๆ ผู้ดูแลควรอำนวยความสะดวกให้ผู้สูงอายุมากที่สุดในการเคลื่อนไหวเพื่อทำกิจวัติต่างๆ เช่น อาจจัดหาอุปกรณ์ช่วยในการเดิน 
        การดูแลสิ่งแวดล้อมความปลอดภัยภายในบ้าน การติดราวจับในห้องน้ำ หรือพื้นที่มีความลาดชัน รวมถึงวางสิ่งของให้เป็นระเบียบเพื่อป้องกันการหกล้มและอุบัติเหตุอื่นๆ 
        การจัดเตรียมยาที่ถูกต้องเหมาะสม อย่างการติดฉลากยาให้ละเอียด การรับประทานอาหารเฉพาะโรค และการเอาใจใส่ดูแลเรื่องของสุขภาพจิต ด้วยความรัก 
        ความเห็นอกเห็นใจ เพื่อป้องกันภาวะซึมเศร้า รวมไปถึงการหมั่นสังเกตความผิดปกติร่างกายของผู้สูงอายุเช่น อาการซึมเศร้า  เจ็บหน้าอก ไอเรื้อรัง  น้ำหนักลด 
        หรืออาการผิดปกติที่แสดงออกทางร่างกายอื่นๆที่ต้องพาผู้สูงอายุไปพบแพทย์
    ';
}else{
    $str_score = $score;
    $str_th = 'ผู้สูงอายุ (กลุ่มติดสังคม)';
    $str_en = 'ผู้สูงอายุที่พึ่งตนเองได้ ช่วยเหลือผู้อื่น ชุมชนและสังคมได้ มีผลรวม คะแนน ADL ตั้งแต่ 12 คะแนน ขึ้นไป
    
    คำแนะนำในการดูแลผู้สูงอายุ 
        การส่งเสริมสุขภาพและป้องกันโรคให้ผู้สูงอายุมีสุขภาพแข็งแรง และชะลอการเกิดโรคเรื้อรัง ด้วยหลักการปฏิบัติตนที่ถูกต้องและเหมาะสมตาม 5 อ. 
        ของการดูแลสุขภาพผู้สูงอายุเพื่อการมีสุขภาพดีและอายุยืน ได้แก่ 1.อ.อาหาร รับประทานอาหาร ครบ 5 หมู่ทุกวัน ลดหวาน มัน เค็ม เน้นผัก ผลไม้ 
        และดื่มน้ำอย่างน้อยวันละ 8 แก้ว 2. ออกกำลังกายอย่างสม่ำเสมออย่างน้อย3-4ครั้งต่อสัปดาห์ 3.อ.อารมณ์ ส่งเสริมสุขภาพจิตและอารมณ์ มีจิตแจ่มใส 
        มองโลกในแง่บวก  4.อ.อดิเรก มีกิจกรรมงานอดิเรกที่ชอบเช่น ปลูกต้นไม้ อ่านหนังสือธรรมะ 5.อ.อนามัย ดูแลสุขภาพช่องปากและฟัน 
        ตรวจสุขภาพเป็นประจำทุกปี เป็นต้นนอกจากนี้ ครอบครัวบุตรหลานควรช่วยกันดูแล เอาใจใส่ผู้สูงอายุอันเป็นการแสดงออกถึงความรักที่มีต่อผู้สูงอายุที่เป็นบุคคลสำคัญของครอบครัว 
        เพื่อให้ผู้สูงอายุมีสุขภาพกายและสุขภาพใจที่ดี มีความสุข มีคุณภาพชีวิตที่ดีตามวัย อยู่กับบุตรหลานให้นานที่สุด
    ';
}


?>

<!DOCTYPE html>
<html lang="en">
<head>

    <?php include('_main_header.php');?>

</head>

<body>

<div class="super_container">

    <!-- Header -->
    <?php include('_main_menu_top.php');?>

    <div class="container" style="padding-top: 120px;">

        <!-- header -->
        <h2>ดัชนีจุฬา เอดีแอล (Chula ADL index)</h2>
        <hr>

        <div class="alert alert-warning p-5" role="alert">


            <div class="text-center">
                <h2 class="alert-heading text-danger font-weight-bold"> <?php echo $str_score; ?></h2>
                <hr>
                <h2 class="alert-heading"> <?php echo $str_th; ?> </h2>
                <h3 class="alert-heading"> <?php echo $str_en; ?> </h3>
            </div>

            <p class="font-weight-bold" style="font-size: 25px"  hidden>
                รายละเอียดเกี่ยวกับ
            </p>

        </div>

        <div class="row pt-5">
            <div class="offset-3 col-md-6">
                <a class="btn btn-success btn-lg btn-block" href="/oldperson/chula.php">
                    <h3 class="font-weight-bold text-white">กลับไปยังหน้าหลัก</h3>
                </a>
            </div>
        </div>


    </div>

    <!-- Footer -->
    <?php include('_main_footer.php');?>

</div>


<?php include('_main_script.php');?>
<?php include('_modal_message.php');?>

<script>

</script>

</body>
</html>
